       IDENTIFICATION DIVISION.
       PROGRAM-ID. APP.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 NUM1 PIC 9(4) VALUE 2.
       01 NUM2 PIC 9(4) VALUE 3.
       01 RESULTADO PIC 9(4).

       PROCEDURE DIVISION.
       CALL "SOMA" USING NUM1 NUM2 RESULTADO
       DISPLAY RESULTADO
       STOP RUN.
